Autodesk.Revit.DB.PropertySelectionType
Since:
2026
An enumerated type listing the types of properties to find in the template.
Since:
2026

Autodesk.Revit.DB.PropertySelectionType.NonExporting
The properties that are not included in export.

Autodesk.Revit.DB.PropertySelectionType.Exporting
The properties that are included in export.

Autodesk.Revit.DB.PropertySelectionType.All
All the properties.